app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2009-07-07 05:12:53', 'c42e63d6dab08d6945cc2e6609a57ffe606efeab50b9618421abd841209e123420f8330df66e592fd99ce0d803aab9c9c28227c43e8d375908eca94ad47ff73b', '2009-07-07 05:12:53', 'captproton', 'QeZEUyaWrKHYAQ0JtFGb', '7bfe2e3a833d46481c7ecde641d4125ee4faba08f9b5a5cc4dc8d571abe651d876e52997985f4d9cc93f89f3a7492c69176f37db7e94620a93772d828485b2c4', 'ad@mail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save